CreateAlertRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"/>
  <soapenv:Body xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <as:CreateAlertRequest xmlns:as="http://uicds.org/AlertService"
                             xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                             xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1"
                             xsi:schemaLocation="http://uicds.org/AlertService AlertService.xsd">
         <cap:alert xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">
            <cap:identifier xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">UICDS-Test-Identifier1</cap:identifier>
            <cap:sender xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">IncidentManagement@agency.gov</cap:sender>
            <cap:sent xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">2009-09-15T12:00:00</cap:sent>
            <cap:status xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">Actual</cap:status>
            <cap:msgType xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">Alert</cap:msgType>
            <cap:scope xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">Public</cap:scope>
            <cap:info xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">
               <cap:language xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">en-US</cap:language>
               <cap:category xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">CBRNE</cap:category>
               <cap:event xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">A hazardous chemical event has occurred</cap:event>
               <cap:urgency xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">Immediate</cap:urgency>
               <cap:severity xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">Extreme</cap:severity>
               <cap:certainty xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">Observed</cap:certainty>
               <cap:effective xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">2009-09-15T12:00:00</cap:effective>
               <cap:onset xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">2009-09-15T12:00:00</cap:onset>
               <cap:senderName xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">Bob McGillicuddy</cap:senderName>
               <cap:headline xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">A hazardous chemical event has occurred</cap:headline>
               <cap:description xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">Overturned tanker on the highway.</cap:description>
               <cap:area xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">
                  <cap:areaDesc xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">The highway, mile marker 128</cap:areaDesc>
                  <cap:polygon xmlns:cap="urn:oasis:names:tc:emergency:cap:1.1">38.8,-77.3 38.8,-77.1 39.0,-77.1 39.0,-77.3 38.8,-77.3</cap:polygon>
               </cap:area>
            </cap:info>
         </cap:alert>
      </as:CreateAlertRequest>
  </soapenv:Body>
</soapenv:Envelope>
